# AddFace Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedShapeBuilder..::..AddFace Method
TessellatedShapeBuilder Class See Also
---
Adds a face to the currently open connected face set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public void AddFace(
	TessellatedFace face
)
```

Visual Basic
---
```text
Public Sub AddFace ( _
	face As TessellatedFace _
)
```

Visual C++
---
```text
public:
void AddFace(
	TessellatedFace^ face
)
```

# ### Parameters
face
    Type: Autodesk.Revit.DB..::..TessellatedFace Face to add. The 'face' parameter can be added only once, as its boundary loops will be cleared while adding and 'face' will become unusable.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The 'face' does not have enough loops and/or vertices to be valid. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | A face set is closed and faces cannot be added to it. |

# See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace